packages/StoveOpt/StoveOpt-0.3.0.tar.gz/StoveOpt-0.3.0/StoveOpt/foamfiles/counterFlowFlame2D/system/run/blockMeshDict_01.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
/* Cookstove body geometry:*/
(0.0 0.0 0.0)
(0.0 0.1 0.0)
(0.0 0.0 0.15)
(0.0 0.1 0.15)
(0.0 0.1 0.16)
(0.0 0.0 0.16)
(0.0 0.0 0.3)
(0.0 0.1 0.3)
(0.0 0.17 0.3)
(0.0 -0.07 0.3)
(0.0 -0.07 0.5)
(0.0 -0.04 0.5)
(0.0 0.14 0.5)
(0.0 0.17 0.5)
(0.0 -0.04 0.33)
(0.0 0.14 0.33)
(0 0.025 0.076)
(0 0.075 0.076)
(0 0.075 0.152)
(0 0.025 0.152)
(0 0.0 0.33)
(0 0.1 0.33)
(-0.1 0.0 0.0)
(-0.1 0.1 0.0)
(-0.1 0.0 0.15)
(-0.1 0.1 0.15)
(-0.1 0.1 0.16)
(-0.1 0.0 0.16)
(-0.1 0.0 0.3)
(-0.1 0.1 0.3)
(-0.1 0.17 0.3)
(-0.1 -0.07 0.3)
(-0.1 -0.07 0.5)
(-0.1 -0.04 0.5)
(-0.1 0.14 0.5)
(-0.1 0.17 0.5)
(-0.1 -0.04 0.33)
(-0.1 0.14 0.33)
(-0.1 0.025 0.076)
(-0.1 0.075 0.076)
(-0.1 0.075 0.152)
(-0.1 0.025 0.152)
(-0.1 0.0 0.33)
(-0.1 0.1 0.33)
(0 -0.04 0.3)
(-0.1 -0.04 0.3)
(0 0.14 0.3)
(-0.1 0.14 0.3)
                            
                                                                      
                                                                  
                                                                    
                                                                     
                                                                       
                                                                        
                                                                            
                                                                            
                                                                            
                                                                            
                                                                            
                                                                            
                                                                            
                                                                            

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    air
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
